---
type: ShapeBuilder
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ShapeBuilder

`Autodesk.Revit.DB.ShapeBuilder` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |